

#include<iostream>//input output stream 인풋 아웃풋 표준을 포함하다.
using namespace std;

int main() {
	//printf("dddd"); //C
	/* 주-석 은 초반엔 많이쓰는게 공부에 도움은 되지만 후에 코드를 공개할때 너무 지저분해서 남발하면 안됨
	펜으로 쓰고 옮기고 옮기고?
	*/
	cout << "지옥으로 온걸 환영한다 ㅋㅋㅋㅋ" << endl; //C++ 문자열을 쓸때는 항상""를 사용
	cout << 'a' << endl; // 문자
	cout << "지금이라도 늦지 않았어....";
	cout << 1234 << endl; //endline 줄바꿈
	cout << "★ ★ ★ ★ ★ ★ ★ ★ ★ ★" << endl; // 컨트롤 +d 한줄 복사
	cout << "★ ★ ★ ★ ★ ★ ★ ★ ★ ★" << endl; // 컨트롤 + x 한줄 삭제
	cout << "★ ★                   ★ ★" << endl;
	cout << "★ ★                   ★ ★" << endl;
	cout << "★ ★      반가워요     ★ ★" << endl;
	cout << "★ ★                   ★ ★" << endl;
	cout << "★ ★                   ★ ★" << endl;
	cout << "★ ★ ★ ★ ★ ★ ★ ★ ★ ★" << endl;
	cout << "★ ★ ★ ★ ★ ★ ★ ★ ★ ★" << endl; // 컨트롤 k + c  지정범위 주석, 컨트롤 k + u 주석해제

	int a = 1;
	cout << a << endl;

	/*숙제 : 개인블로그만들기(카테고리별로 메뉴만들기?)
			cout을 이용하여 원하는 캐릭터를 그려보자.
			깃허브주소, 영상링크, 블로그링크 취업포폴이 될것임

	*/


	/*
		■
		■■
		■■■
		■■■■
		■■■■■
		■■■■■■
		■■■■■■■
		■■■■■■■■
		■■■■■■■■■
		■■■■■■■■■■
		■■■■■■■■■■■
		■■■■■■■■■■■■
		■■■■■■■■■■■■■
		●
*/
	cout << "□□□□□□□□□□□□□□□" << endl;
	cout << "□□□□■■■■■■□□□□□" << endl;
	cout << "□□□■■■■■■■■■■□□" << endl;
	cout << "□□□■■■■■■■■□□□□" << endl;
	cout << "□□■■■■■■■■■■■□□" << endl;
	cout << "□□■■■■■■■■■■■■□" << endl;
	cout << "□□■■■■■■■■■■■□□" << endl;
	cout << "□□□□■■■■■■■■□□□" << endl;
	cout << "□□□■■■■■■■□□□□□" << endl;
	cout << "□□■■■■■■■■■■□□□" << endl;
	cout << "□■■■■■■■■■■■■□□" << endl;
	cout << "□■■■■■■■■■■■■□□" << endl;
	cout << "□■■■■■■■■■■■■□□" << endl;
	cout << "□■■■■■■■■■■■■□□" << endl;
	cout << "□□□■■■□□■■■□□□□" << endl;
	cout << "□□■■■□□□□■■■□□□" << endl;
	cout << "□■■■■□□□□■■■■□□" << endl;
	cout << "□□□□□□□□□□□□□□□□□■■■□□■■□□□□□□" << endl;
	cout << "□□□□□□□□□□□□□□□■■□■□■■□■□□□□□□" << endl;
	cout << "□□□□□□□□□□□□□□■□□□■■□□□■□□□□□□" << endl;
	cout << "□□□□□□□□□□□□□■■□□■□□□□■□□□□□□□" << endl;
	cout << "□□□□□□□□□□□■■□□□■□□□□■■□□□□□□□" << endl;
	cout << "□□□□□□□□□■■□□□□□□□□□□□□■□□□□□□" << endl;
	cout << "□□□□□□□□■□□□□□□□□□□□■■□□■□□□□□" << endl;
	cout << "□□□□□□□■□□□□□□□□□□□■□□□□□■□□□□" << endl;
	cout << "□□□□□□■□□□□□□□□□□□□□□■■□□■□□□□" << endl;
	cout << "□□□□□■□□□□□□□□□□□□□□■□□■□■□□□□" << endl;
	cout << "□□□□■□□□□□□□□□■□□□□□■□■■□□■□□□" << endl;
	cout << "□□□■□□□□□□□□□□■□□□□□□■■□□□□■□□" << endl;
	cout << "□□□■□□□□□□□□□□■□□□□□□□□□□□□□■■" << endl;
	cout << "□□■□□□□□□□□□□□□■□□□□□□□□□□□□□■" << endl;
	cout << "□□■□□□□□□□□□□□□□■□□□□□□□□□□□■□" << endl;
	cout << "□■□□□□□□□□□□□□□□□■□□□□□□□□□□■□" << endl;
	cout << "□■□□□□□□□□□□□□□□□■■■□□□□□□■■□□" << endl;
	cout << "■□□□□□□□□□□□□□□□□□■□■■■■■■□□□□" << endl;
	cout << "■□□□□□□□□□□□□□□□□□■□□□□□□□□□□□" << endl;
	cout << "■□□□□□□□□□□□□□□□□□□■□□□□□□□□□□" << endl;
	cout << "■□□□□□□□□□□□□□□□□□□□■□□□□■■□□□" << endl;
	cout << "■□□□□□□□□□□□□□□□□□□□■□□□■□■□□□" << endl;
	cout << "■□□□□□□□□□□□□□□□□□□□□■■■□■□□■■" << endl;
	cout << "□□□□□□□□□□□□□□□□□■■■■■■□□■■■□□" << endl;
	cout << "□□□□□□□□□□□□□□□□□□□□□□□□□□□□□■" << endl;
	cout << "■□□□□□□□□□□□□□□□□□□□□□□□□□■■■■" << endl;
	cout << "□■■□□□□□□□□□□□□□□□□□□□■■■■□□□□" << endl;
	cout << "□□□■■■□□□□□□□□□□□□□■■■■□□□□□□□" << endl;
	cout << "□□□□□□■■■■□□□□□■■■■□□□■□□□□□□□" << endl;

}