#include<iostream>
using namespace std;
/*
¡á
¡á¡á
¡á¡á¡á
*/
int main() {
	cout << "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à" << endl;
	cout << "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à" << endl;
	cout << "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à" << endl;
	cout << "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à" << endl;
	cout << "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à" << endl;
	cout << "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à" << endl;
	cout << "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à" << endl;
	cout << "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à" << endl;
	cout << "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à" << endl;
	cout << "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à" << endl;
	cout << "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à" << endl;
	cout << "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à" << endl;
	cout << "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à" << endl;
};